# 2ppt 33page 3.파이썬 자료형 - Pandas DataFrame

# 딕셔너리를 활용한 데이터 분석을 위한 자료구조 생성

In [15]:
#데이터 프레임 라이브러리 활용
import pandas as pd

In [16]:
#딕셔너리르 활용한 데이터프레임 생성
data = {'name':['A고객','B고객','C고객','D고객'],'age':[27,40,33,29],'stock_age':[2,10,5,1]}

In [17]:
data

{'age': [27, 40, 33, 29],
 'name': ['A고객', 'B고객', 'C고객', 'D고객'],
 'stock_age': [2, 10, 5, 1]}

In [18]:
dataFrame=pd.DataFrame(data)

In [19]:
#데이터 프레임 : 스프레드시트 형태의 자료구조

In [20]:
dataFrame

   age name  stock_age
0   27  A고객          2
1   40  B고객         10
2   33  C고객          5
3   29  D고객          1

# 리스트를 활용한 데이터 분석을 위한 자료구조 생성

In [21]:
import pandas as pd

In [22]:
#리스트 생성
test = [10,100,1000,10000]

In [23]:
#데이터프레임 변환
testDf = pd.DataFrame(test)
testDf

       0
0     10
1    100
2   1000
3  10000

In [24]:
testDf.columns=["test"]
testDf

    test
0     10
1    100
2   1000
3  10000

# 리스트를 활용한 데이터 분석을 위한 자료구조 생성 - 응용

In [25]:
import pandas as pd

In [26]:
#리스트 여러개 생성
test1 = [10,20,30,40,50]
test2 = ["고객1","고객2","고객3","고객4","고객5"]
test3 = ["서울","대전","부산","제주","경기"]

In [39]:
#데이터프레임 변환
tDF1=pd.DataFrame(test1)
tDF1

    0
0  10
1  20
2  30
3  40
4  50

In [40]:
tDF2=pd.DataFrame(test2)
tDF2

     0
0  고객1
1  고객2
2  고객3
3  고객4
4  고객5

In [41]:
tDF3=pd.DataFrame(test3)
tDF3

    0
0  서울
1  대전
2  부산
3  제주
4  경기

In [44]:
finalDF=pd.concat([tDF1,tDF2,tDF3],axis=1)

In [45]:
finalDF

    0    0   0
0  10  고객1  서울
1  20  고객2  대전
2  30  고객3  부산
3  40  고객4  제주
4  50  고객5  경기

In [46]:
finalDF.columns=['price','고객','지역']
finalDF

   price   고객  지역
0     10  고객1  서울
1     20  고객2  대전
2     30  고객3  부산
3     40  고객4  제주
4     50  고객5  경기